In [18]:
import pandas as pd

In [20]:
data2 = pd.read_csv(r'C:\Users\akt\OneDrive - Huron Consulting Group\Desktop\Mydat2.csv')

In [21]:
data2

      Name  company  Experience
0  Abilash    Huron           4
1    Ajesh   Legato           5
2    Jophi       NR           2
3     Sanu  Muthoot           4

In [22]:
data1 = pd.read_excel(r'C:\Users\akt\OneDrive - Huron Consulting Group\Desktop\mydat1.xlsx')

In [23]:
data1

      Name  age  Salary
0  Abilash   25   35000
1    Ajesh   26   40000
2    Sanu    25   39000
3   Jophil   24   55000

In [25]:
data3 = pd.read_csv(r'C:\Users\akt\OneDrive - Huron Consulting Group\Desktop\mydat3.tsv', sep='\t')

In [26]:
data3

   Rollnum     Name  Batch
0     1001  Abilash   1840
1     1002     Sanu   1009
2     1003    Ajesh   1980
3     1004   Jophil   1800

In [28]:
data3

  Rollnum\tName\tBatch
0  1001\tAbilash\t1840
1     1002\tSanu\t1009
2    1003\tAjesh\t1980
3   1004\tJophil\t1800